brianreinhold/NordicPHDs/nRF52/ble_app_ghs_bt_sig/btle_utils.c
        const unsigned int years = (unsigned int)(epoch/( 365 * 4 + 1) * 4);
        epoch %= 365 * 4 + 1;

        unsigned int year;
        for (year = 3; year > 0; year--)
        {
            if (epoch >= days[year][0])
                break;
        }

        unsigned int month;
        for (month = 11; month > 0; month--)
        {
            if (epoch >= days[year][month])
                break;
        }
        date_time->century = 20;
        date_time->year  = years + year;
        date_time->month = month + 1;
        date_time->day   = (unsigned char)(epoch - days[year][month] + 1);
    }

    bool absBytesToAbsStruct(s_Abs **absPtr, unsigned char *timeBytesIn)
    {
        if (absPtr == NULL || (*absPtr) == NULL || timeBytesIn == NULL)
        {
            NRF_LOG_DEBUG("At least one of the input parameters was NULL");
            return false;
        }
        s_Abs *abs = (*absPtr);
        abs->century =timeBytesIn[0];
        abs->year = timeBytesIn[1];
        abs->month = timeBytesIn[2];
        abs->day = timeBytesIn[3];
        abs->hour = timeBytesIn[4];
        abs->min = timeBytesIn[5];
        abs->sec = timeBytesIn[6];
        abs->hundredth = timeBytesIn[7];
        *absPtr = abs;
        return true;
    }

    bool absStructToAbsBytes(unsigned char **timeBytesPtr, s_Abs *absIn)
    {
        if (timeBytesPtr == NULL || (*timeBytesPtr) == NULL || absIn == NULL)
        {
            NRF_LOG_DEBUG("At least one of the input parameters was NULL");
            return false;
        }
        unsigned char *timeBuf = *timeBytesPtr;
        timeBuf[0] = absIn->century;
        timeBuf[1] = absIn->year;
        timeBuf[2] = absIn->month;
        timeBuf[3] = absIn->day;
        timeBuf[4] = absIn->hour;
        timeBuf[5] = absIn->min;
        timeBuf[6] = absIn->sec;
        timeBuf[7] = absIn->hundredth;
        *timeBytesPtr = timeBuf;
        return true;
    }


    /*
      This method handles 'date time adjustments' so the PHG never has to. It is a lot easier
      for th ePHD to do this task as it has all the information needed, and it does not have to
      pass all the information to the PHG so it can do it.

      This method is called after the PHG sets the time. The current time line of the PHD is
      passed in oldTimeIn and the new one written by the PHG is newTimeIn. This method takes
      the difference between the two, and adds that difference to the time stamps of all stored
      data time stamps (stored data must have time stamps). Setting the time is only an option
      for absolute and base offset times.
    */
    void adjustTimeStamps(unsigned char* oldTimeIn, unsigned char* newTimeIn, s_Abs **absTimePtr)
    {
        s_Abs oldTime;
        s_Abs newTime;
        s_Abs *oldTimePtr = &oldTime;
        s_Abs *newTimePtr = &newTime;
        s_Abs *absTime = *absTimePtr;

        absBytesToAbsStruct(&oldTimePtr, oldTimeIn); // Convert bytes to struct
        absBytesToAbsStruct(&newTimePtr, newTimeIn); // convert bytes to struct

        unsigned long long timeSinceEpochOld = date_time_to_epoch(&oldTime);
        unsigned long long timeSinceEpochNew = date_time_to_epoch(&newTime);
        unsigned long long diff = timeSinceEpochNew - timeSinceEpochOld;
        if (diff == 0)
        {
            return;
        }
        char buf[28];

        memset(buf, 0, 28);
        unsigned char timeBuf[8];
        unsigned char *timeBufPtr = timeBuf;
    
        // Only needed for diagnostics to show time before adjustment
        //absStructToAbsBytes(&timeBuf, absTime); // Convert struct to bytes
        //NRF_LOG_DEBUG("Time before adjustment %s", (uint32_t)byteToHex(timeBuf, buf, " ", 8));

        unsigned long long epoch = date_time_to_epoch(absTime) + diff;
        epoch_to_date_time(absTime, epoch);
        absStructToAbsBytes(&timeBufPtr, absTime); // Convert struct to bytes

          //  NRF_LOG_DEBUG("Time after adjustment %s", (uint32_t)byteToHex(timeBuf, buf, " ", 8));
        *absTimePtr = absTime;
    }
#endif

#ifndef _WIN32
// Generic method to create a primary service
ret_code_t createPrimaryService(unsigned short* serviceHandle, unsigned short serviceUuid)
{
    ret_code_t    error_code;
    ble_uuid_t  ble_uuid;

    BLE_UUID_BLE_ASSIGN(ble_uuid, serviceUuid);

    error_code = sd_ble_gatts_service_add(
        BLE_GATTS_SRVC_TYPE_PRIMARY,
        &ble_uuid,
        serviceHandle);

    if (error_code != NRF_SUCCESS)
    {
        NRF_LOG_DEBUG("Failed to initialize service. Error code: 0x%02X", error_code);
        return error_code;
    }
    NRF_LOG_DEBUG("Service initiated");
    return NRF_SUCCESS;
}

// Generic method to create a characteristic and add it to a service
ret_code_t createStandardCharacteristic(
    uint16_t serviceHandle,
    ble_gatts_char_handles_t* charHandles,
    uint16_t uuid,
    bool hasCCCD,
    unsigned char indicate,
    uint16_t valueLength,
    uint8_t *value,
    uint8_t trapReadWrite,
    ble_gap_conn_sec_mode_t cccdWritePermission,
    ble_gap_conn_sec_mode_t attrReadPermission,
    ble_gap_conn_sec_mode_t attrWritePermission,
    bool isStatic)
{
    ret_code_t           error_code;
    ble_gatts_char_md_t  char_md;
    ble_gatts_attr_md_t  cccd_md;
    ble_gatts_attr_md_t* cccd_md_ptr = NULL;
    ble_gatts_attr_t     attr_char_value;
    ble_uuid_t           ble_uuid;
    ble_gatts_attr_md_t  attr_md;
    uint8_t              dummy = 1;

    if (hasCCCD)
    {
        memset(&cccd_md, 0, sizeof(cccd_md));

        cccd_md.rd_auth = 0;
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
        cccd_md.write_perm.lv = cccdWritePermission.lv;
        cccd_md.write_perm.sm = cccdWritePermission.sm;
        cccd_md.vloc = BLE_GATTS_VLOC_STACK;
        cccd_md_ptr = &cccd_md;
    }

    memset(&char_md, 0, sizeof(char_md));

    if (hasCCCD)
    {
        if (indicate & BLE_GATT_HVX_INDICATION)
        {
            char_md.char_props.indicate = 1;
        }
        if (indicate & BLE_GATT_HVX_NOTIFICATION)
        {
            char_md.char_props.notify = 1;
        }
    }
    char_md.char_props.read = ((attrReadPermission.sm == 0) ? 0 : 1);
    char_md.char_props.write = ((attrWritePermission.sm == 0) ? 0 : 1);
    char_md.p_char_user_desc = NULL;
    char_md.p_char_pf = NULL;
    char_md.p_user_desc_md = NULL;
    char_md.p_cccd_md = cccd_md_ptr;
    char_md.p_sccd_md = NULL;

    BLE_UUID_BLE_ASSIGN(ble_uuid, uuid);

    memset(&attr_md, 0, sizeof(attr_md));

    attr_md.read_perm.sm = attrReadPermission.sm;
    attr_md.read_perm.lv = attrReadPermission.lv;
    attr_md.write_perm.sm = attrWritePermission.sm;
    attr_md.write_perm.lv = attrWritePermission.lv;

