brianreinhold/NordicPHDs/nRF52/ble_app_ghs_bt_sig/btle_utils.c
    attr_md.vloc = BLE_GATTS_VLOC_STACK;
    attr_md.rd_auth = ((TRAP_BOTH == trapReadWrite) || (TRAP_READ == trapReadWrite)) ? 1 : 0;
    attr_md.wr_auth = ((TRAP_BOTH == trapReadWrite) || (TRAP_WRITE == trapReadWrite)) ? 1 : 0;
    attr_md.vlen = 1;

    memset(&attr_char_value, 0, sizeof(attr_char_value));

    attr_char_value.p_uuid = &ble_uuid;
    attr_char_value.p_attr_md = &attr_md;
    attr_char_value.init_len = (valueLength == 0) ? 1 : valueLength; //attr_char_value_init_len;
    attr_char_value.init_offs = 0;
    attr_char_value.max_len = isStatic? (valueLength + OPCODE_LENGTH + HANDLE_LENGTH) : (NRF_SDH_BLE_GAP_DATA_LENGTH - 4 - OPCODE_LENGTH - HANDLE_LENGTH);
    if ((value == NULL) || (valueLength == 0))
    {
        attr_char_value.p_value = &dummy;    // Fill with any garbage
    }
    else
    {
        NRF_LOG_DEBUG("char val length %u", valueLength);
        attr_char_value.p_value = value;
    }

    error_code = sd_ble_gatts_characteristic_add(serviceHandle,
        &char_md,
        &attr_char_value,
        charHandles);

    if (error_code != NRF_SUCCESS)
    {
        NRF_LOG_DEBUG("Failed to initialize characteristics. Error code: 0x%02X", error_code);
        return error_code;
    }
    NRF_LOG_DEBUG("Characteristic 0x%04X initiated", uuid);

    return NRF_SUCCESS;
}


static ble_gatts_char_handles_t m_systemId_handle;
static ble_gatts_char_handles_t m_manufacturer_handle;
static ble_gatts_char_handles_t m_model_handle;
static ble_gatts_char_handles_t m_serial_handle;
static ble_gatts_char_handles_t m_firmware_handle;
static ble_gatts_char_handles_t m_software_handle;
static ble_gatts_char_handles_t m_hardware_handle;
static ble_gatts_char_handles_t m_regcert_handle;
static ble_gatts_char_handles_t m_sUdi_handle;

static uint16_t add_udi_entry(char* udi_entry, uint16_t index, uint8_t* udi)
{
    if (udi_entry != NULL && strlen(udi_entry) > 0)
    {
        memcpy(&udi[index], udi_entry, strlen(udi_entry));
        index = index + strlen(udi_entry) + 1;
    }
    return index;
}

ret_code_t createDeviceInformationService(unsigned short int *serviceHandle, s_SystemInfo *systemInfo)
{
    ret_code_t error_code = createPrimaryService(serviceHandle, BTLE_DEVICE_INFORMATION_SERVICE);
    if (error_code != NRF_SUCCESS)
    {
        NRF_LOG_DEBUG("Unable to create Device Information Service. Error code 0x%X\n", error_code);
        return error_code;
    }


    error_code = createStandardCharacteristic(*serviceHandle,
        &m_systemId_handle,
        BTLE_DIS_SYSTEM_ID_CHAR,
        false,
        BLE_GATT_HVX_INVALID,  // ignored since CCCD is set to false
        8,
        systemInfo->systemId,
        systemInfo->trapRead,
        (ble_gap_conn_sec_mode_t) {    0, 0},
        (ble_gap_conn_sec_mode_t) {    1, 1},
        (ble_gap_conn_sec_mode_t) {    0, 0},
        true);

    if (error_code != NRF_SUCCESS)
    {
        NRF_LOG_DEBUG("Unable to create System Id characteristic. Error code 0x%X\n", error_code);
    }

    if (systemInfo->manufacturer != NULL)
    {
        error_code = createStandardCharacteristic(*serviceHandle,
            &m_manufacturer_handle,
            BTLE_DIS_MANUFACTURER_DEVICE_NAME_CHAR,
            false,
            BLE_GATT_HVX_INVALID,  // ignored since CCCD is set to false
            (uint16_t)strlen(systemInfo->manufacturer),
            (uint8_t *)systemInfo->manufacturer,
            systemInfo->trapRead,
            (ble_gap_conn_sec_mode_t) {    0, 0},
            (ble_gap_conn_sec_mode_t) {    1, 1},
            (ble_gap_conn_sec_mode_t) {    0, 0},
            true);

        if (error_code != NRF_SUCCESS)
        {
            NRF_LOG_DEBUG("Unable to create Manufacturer Name characteristic. Error code 0x%X\n", error_code);
        }
    }
    if (systemInfo->modelNumber != NULL)
    {
        error_code = createStandardCharacteristic(*serviceHandle,
            &m_model_handle,
            BTLE_DIS_MODEL_NUMBER_CHAR,
            false,
            BLE_GATT_HVX_INVALID,  // ignored since CCCD is set to false
            (uint16_t)strlen(systemInfo->modelNumber),
            (uint8_t *)systemInfo->modelNumber,
            systemInfo->trapRead,
            (ble_gap_conn_sec_mode_t) {    0, 0},
            (ble_gap_conn_sec_mode_t) {    1, 1},
            (ble_gap_conn_sec_mode_t) {    0, 0},
            true);

        if (error_code != NRF_SUCCESS)
        {
            NRF_LOG_DEBUG("Unable to create Model Number characteristic. Error code 0x%X\n", error_code);
        }
    }
    if (systemInfo->serialNo != NULL)
    {
        error_code = createStandardCharacteristic(*serviceHandle,
            &m_serial_handle,
            BTLE_DIS_SERIAL_NUMBER_CHAR,
            false,
            BLE_GATT_HVX_INVALID,  // ignored since CCCD is set to false
            (uint16_t)strlen(systemInfo->serialNo),
            (uint8_t *)systemInfo->serialNo,
            systemInfo->trapRead,
            (ble_gap_conn_sec_mode_t) {    0, 0},
            (ble_gap_conn_sec_mode_t) {    1, 1},
            (ble_gap_conn_sec_mode_t) {    0, 0},
            true);

        if (error_code != NRF_SUCCESS)
        {
            NRF_LOG_DEBUG("Unable to create Serial Number characteristic. Error code 0x%X\n", error_code);
        }
    }
    if (systemInfo->firmware != NULL)
    {
        error_code = createStandardCharacteristic(*serviceHandle,
            &m_firmware_handle,
            BTLE_DIS_FIRMWARE_REVISION_CHAR,
            false,
            BLE_GATT_HVX_INVALID,  // ignored since CCCD is set to false
            (uint16_t)strlen(systemInfo->firmware),
            (uint8_t *)systemInfo->firmware,
            systemInfo->trapRead,
            (ble_gap_conn_sec_mode_t) {    0, 0},
            (ble_gap_conn_sec_mode_t) {    1, 1},
            (ble_gap_conn_sec_mode_t) {    0, 0},
            true);

        if (error_code != NRF_SUCCESS)
        {
            NRF_LOG_DEBUG("Unable to create Firmware Revision characteristic. Error code 0x%X\n", error_code);
        }
    }
    if (systemInfo->hardware != NULL)
    {
        error_code = createStandardCharacteristic(*serviceHandle,
            &m_hardware_handle,
            BTLE_DIS_HARDWARE_REVISION_CHAR,
            false,
            BLE_GATT_HVX_INVALID,  // ignored since CCCD is set to false
            (uint16_t)strlen(systemInfo->hardware),
            (uint8_t *)systemInfo->hardware,
            systemInfo->trapRead,
            (ble_gap_conn_sec_mode_t) {    0, 0},
            (ble_gap_conn_sec_mode_t) {    1, 1},
            (ble_gap_conn_sec_mode_t) {    0, 0},
            true);

        if (error_code != NRF_SUCCESS)
        {
            NRF_LOG_DEBUG("Unable to create Hardware Revision characteristic. Error code 0x%X\n", error_code);
        }
    }
    if (systemInfo->software != NULL)
    {
        error_code = createStandardCharacteristic(*serviceHandle,
            &m_software_handle,
            BTLE_DIS_SOFTWARE_REVISION_CHAR,
            false,
            BLE_GATT_HVX_INVALID,  // ignored since CCCD is set to false
            (uint16_t)strlen(systemInfo->software),
            (uint8_t *)systemInfo->software,
            systemInfo->trapRead,
            (ble_gap_conn_sec_mode_t) {    0, 0},
            (ble_gap_conn_sec_mode_t) {    1, 1},
            (ble_gap_conn_sec_mode_t) {    0, 0},
            true);

        if (error_code != NRF_SUCCESS)
        {
            NRF_LOG_DEBUG("Unable to create Software Revision characteristic. Error code 0x%X\n", error_code);
        }
    }
    if (systemInfo->regCertDataList != NULL)
    {
        error_code = createStandardCharacteristic(*serviceHandle,
            &m_regcert_handle,
            BTLE_DIS_REG_CERT_DATA_LIST_CHAR,
            false,
            BLE_GATT_HVX_INVALID,  // ignored since CCCD is set to false
            systemInfo->regCertDataListLength,
            systemInfo->regCertDataList,
            systemInfo->trapRead,
            (ble_gap_conn_sec_mode_t) {    0, 0},
            (ble_gap_conn_sec_mode_t) {    1, 1},
            (ble_gap_conn_sec_mode_t) {    0, 0},
            true);

        if (error_code != NRF_SUCCESS)
        {
            NRF_LOG_DEBUG("Unable to create RegCertDataList characteristic. Error code 0x%X\n", error_code);
        }
    }
    if (systemInfo->sUdi != NULL)
    {
        uint8_t udi[512];
        memset(udi, 0, 512);
        unsigned char printBuf[1024];
        unsigned char flags = systemInfo->sUdi->flagsUdiLabel + 
                              systemInfo->sUdi->flagsUdiDevId +
                              systemInfo->sUdi->flagsUdiIssuer +
                              systemInfo->sUdi->flagsUdiAuthority;
        udi[0] = flags;
        uint16_t index = 1;
        index = add_udi_entry(systemInfo->sUdi->udi_label, index, udi);
        index = add_udi_entry(systemInfo->sUdi->udi_device_identifier, index, udi);
        index = add_udi_entry(systemInfo->sUdi->udi_issuer_oid, index, udi);
        index = add_udi_entry(systemInfo->sUdi->udi_authority_oid, index, udi);
        memset(printBuf, 0, 1024);
        NRF_LOG_INFO("UDI is %s", (uint32_t)byteToHex(udi, printBuf, " ", index));
        error_code = createStandardCharacteristic(*serviceHandle,
            &m_sUdi_handle,
            BTLE_DIS_UDI_CHAR,
            false,
            BLE_GATT_HVX_INVALID,  // ignored since CCCD is set to false
            index,
            udi,
            systemInfo->trapRead,
            (ble_gap_conn_sec_mode_t) {    0, 0},
            (ble_gap_conn_sec_mode_t) {    1, 1},
            (ble_gap_conn_sec_mode_t) {    0, 0},
            true);

        if (error_code != NRF_SUCCESS)
        {
            NRF_LOG_DEBUG("Unable to create Manufacturer Name characteristic. Error code 0x%X\n", error_code);
        }
    }
    return NRF_SUCCESS;
}

static ble_gatts_char_handles_t m_battery_handle;
ret_code_t createBatteryService(unsigned short int* serviceHandle, unsigned char* batteryCharValue)
{
    ret_code_t error_code = createPrimaryService(serviceHandle, BTLE_BATTERY_SERVICE);
    if (error_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("Unable to create Battery Service. Error code 0x%X", error_code);
        return error_code;
    }

    if (batteryCharValue != NULL)
    {
        error_code = createStandardCharacteristic(*serviceHandle,
            &m_battery_handle,
            BTLE_BATTERY_LEVEL_CHAR,
            false,
            false,
            1,
            batteryCharValue,
            TRAP_READ,
            (ble_gap_conn_sec_mode_t) {0, 0},
            (ble_gap_conn_sec_mode_t) {1, 1},
            (ble_gap_conn_sec_mode_t) {0, 0},
            true);

        if (error_code != NRF_SUCCESS)
        {
            NRF_LOG_ERROR("Unable to create Battery Level characteristic. Error code 0x%X", error_code);
        }
    }
    return NRF_SUCCESS;
}


extern unsigned short SPECIALIZATION;
extern unsigned short numberOfStoredMsmtGroups;
extern const char nameKey[10];
extern s_MsmtData storedMsmts[];

void saveKeysToFlash(ble_gap_sec_keyset_t* keys,
    unsigned char **saveDataBuffer, unsigned short int *saveDataLength,
    unsigned char* cccdSet, unsigned short* noOfCccds)
{
    int i;
    unsigned char *keysDataBuffer = NULL;
    char *buffer = calloc(1, 256);
    ret_code_t err_code;

    uint32_t pg_size = NRF_FICR->CODEPAGESIZE;
    uint32_t pg_num  = NRF_FICR->CODESIZE - (NRF_FICR->CODESIZE * pg_size - 0xE0000) / pg_size;
    
