brianreinhold/NordicPHDs/nRF52/ble_app_ghs_bt_sig/btle_utils.c
    // Okay, what are we doing here. On the dongle, the bootloader occupies flash above 0xE0000. So I have to find how big flash is,
    // subtract 0xE0000 from it, find the number of pages there, and then subtract that number of pages from the total. THAT gives the
    // page where the boot record starts (0xE0000). Now I have to drop a few pages to where I can start. I drop two pages here
    // I still don't know how to dynamically find the page at the top of MY app which gives the
    // area of free flash between my app and the bootloader at the top. The DK, by the way, has no bootloader so I don't need all this.

    NRF_LOG_INFO("Total pages is %u, pg_num is %u pg_size is %u", NRF_FICR->CODESIZE, pg_num, NRF_FICR->CODEPAGESIZE);
    pg_num = pg_num - 2;
    uint8_t *addr = (uint8_t *)(pg_size * pg_num);

    memcpy(localNameKey, addr, sizeof(localNameKey));
    if (memcmp(localNameKey, nameKey, sizeof(nameKey)) != 0)
    {
        return;     // nothing written to Flash yet or not what it should be
    }
    addr = addr + sizeof(nameKey);
    memcpy(keys->keys_own.p_enc_key, addr, sizeof(ble_gap_enc_key_t));
    addr = addr + sizeof(ble_gap_enc_key_t);
    memcpy(keys->keys_own.p_id_key, addr, sizeof(ble_gap_id_key_t));
    addr = addr + sizeof(ble_gap_id_key_t);
    memcpy(keys->keys_peer.p_enc_key, addr, sizeof(ble_gap_enc_key_t));
    addr = addr + sizeof(ble_gap_enc_key_t);
    memcpy(keys->keys_peer.p_id_key, addr, sizeof(ble_gap_id_key_t));
    addr = addr + sizeof(ble_gap_id_key_t);
    memcpy(noOfCccds, addr, sizeof(unsigned short));
    addr = addr + sizeof(unsigned short);
    memcpy(cccdSet, addr, sizeof(unsigned char) * (*noOfCccds)); // Load the cccdSet[]
    addr = addr + sizeof(unsigned char) * (*noOfCccds);
    memcpy(saveDataLength, addr, sizeof(unsigned short));        // Load saveDataLength
    addr = addr + sizeof(unsigned short);
    memcpy(&specialization, addr, sizeof(unsigned short));       // Load specialization: Only needed to allow switching of device types on same chip
    addr = addr + sizeof(unsigned short);
    if (*saveDataLength > 0)
    {
        *saveDataBuffer = calloc(1, *saveDataLength * sizeof(unsigned char));
        memcpy(*saveDataBuffer, addr, *saveDataLength * sizeof(unsigned char)); // Load the saveDataBuffer
        addr = addr + *saveDataLength * sizeof(unsigned char);
    }
    if (specialization == SPECIALIZATION)  // Only needed to allow switching of device types on same chip
    {
        memcpy(&numberOfStoredMsmtGroups, addr, sizeof(unsigned short));            // Load number of stored measurements
        addr = addr + sizeof(unsigned short);
        memcpy(&latestTimeStamp, addr, sizeof(unsigned long long));
        addr = addr + sizeof(unsigned long long);
        #if(USES_STORED_DATA == 1)
            if (numberOfStoredMsmtGroups > 0 && numberOfStoredMsmtGroups <= NUMBER_OF_STORED_MSMTS)
            {
                #if (HEART_RATE != 1 && SPIROMETER != 1)
                    memcpy(storedMsmts, addr, numberOfStoredMsmtGroups * sizeof(s_MsmtData));// Load the stored measurements
                #endif
            }
        #endif
    }
}

void allocateMemoryForSecurityKeys(ble_gap_sec_keyset_t* keys)
{
    keys->keys_own.p_enc_key = calloc(1, sizeof(ble_gap_enc_key_t));
    keys->keys_own.p_id_key = calloc(1, sizeof(ble_gap_id_key_t));
    keys->keys_own.p_sign_key = calloc(1, sizeof(ble_gap_sign_info_t));
    keys->keys_own.p_pk = calloc(1, sizeof(ble_gap_lesc_p256_pk_t));

    keys->keys_peer.p_enc_key = calloc(1, sizeof(ble_gap_enc_key_t));
    keys->keys_peer.p_id_key = calloc(1, sizeof(ble_gap_id_key_t));
    keys->keys_peer.p_sign_key = calloc(1, sizeof(ble_gap_sign_info_t));
    keys->keys_peer.p_pk = calloc(1, sizeof(ble_gap_lesc_p256_pk_t));
}

void clearSecurityKeys(ble_gap_sec_keyset_t* keys)
{
    memset(keys->keys_own.p_enc_key, 0, sizeof(ble_gap_enc_key_t));
    memset(keys->keys_own.p_id_key, 0, sizeof(ble_gap_id_key_t));
    memset(keys->keys_own.p_sign_key, 0, sizeof(ble_gap_sign_info_t));
    memset(keys->keys_own.p_pk, 0, sizeof(ble_gap_lesc_p256_pk_t));

    memset(keys->keys_peer.p_enc_key, 0, sizeof(ble_gap_enc_key_t));
    memset(keys->keys_peer.p_id_key, 0, sizeof(ble_gap_id_key_t));
    memset(keys->keys_peer.p_sign_key, 0, sizeof(ble_gap_sign_info_t));
    memset(keys->keys_peer.p_pk, 0, sizeof(ble_gap_lesc_p256_pk_t));
}

void freeMemoryForSecurityKeys(ble_gap_sec_keyset_t* keys)
{
    if (keys->keys_own.p_enc_key != NULL) free(keys->keys_own.p_enc_key);
    if (keys->keys_own.p_id_key != NULL) free(keys->keys_own.p_id_key);
    if (keys->keys_own.p_sign_key != NULL) free(keys->keys_own.p_sign_key);
    if (keys->keys_own.p_pk != NULL) free(keys->keys_own.p_pk);
    
    if (keys->keys_peer.p_enc_key != NULL) free(keys->keys_peer.p_enc_key);
    if (keys->keys_peer.p_id_key != NULL) free(keys->keys_peer.p_id_key);
    if (keys->keys_peer.p_sign_key != NULL) free(keys->keys_peer.p_sign_key);
    if (keys->keys_peer.p_pk != NULL) free(keys->keys_peer.p_pk);
}
#endif


